Revit 2026 API

# FrameBasisY Property

---

The second basis vector of the frame.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ BasisY { get; set; }
```
```vb
Public Property BasisY As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ BasisY {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member BasisY : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Frame Class

Autodesk.Revit.DB Namespace